// Напишите функцию для нахождения максимального элемента массива.
// Необходимо вычислить произведение двух максимальных элементов массивов a и b
// Первая строка входных данных содержит в себе одно натурально число n (1≤n≤1000) - количество элементов в массиве a.
// Вторая строка содержит элементы массива a, записанные через пробел.
// Третья строка входных данных содержит в себе одно натурально число m (1≤m≤1000) - количество элементов в массиве b
// Четвертая строка содержит элементы массива b, записанные через пробел

package main

import (
	"fmt"
)

func findMax(arr []int) int {
	if len(arr) == 0 {
		return 0
	}
	max := arr[0]
	for _, num := range arr {
		if num > max {
			max = num
		}
	}
	return max
}

func main() {
	var n, m int

	// Чтение массива a
	fmt.Scan(&n)
	a := make([]int, n)
	for i := 0; i < n; i++ {
		fmt.Scan(&a[i])
	}

	// Чтение массива b
	fmt.Scan(&m)
	b := make([]int, m)
	for j := 0; j < m; j++ {
		fmt.Scan(&b[j])
	}

	maxA := findMax(a)
	maxB := findMax(b)

	product := maxA * maxB

	fmt.Println(product)
}
